# Задача №1. Решение в группах

# За день машина проезжает n километров. Сколько
# дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя
# пользоваться условной инструкцией if и циклами.


print("Сколько километров машина проезжает за день?")
n = int (input())
print("Какой длины маршрут?")
m= int (input())


print(m/n)