# Задача №3. 
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.


print("Введите количество учеников в первом классе: ")
a = int(input())
print("Введите количество учеников во втором классе: ")
b = int(input())
print("Введите количество учеников в третьем классе: ")
c = int(input())

print(round(a/2,0))
print(round(b/2,0))
print(round(c/2,0))

